---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
source: html/02355511-bcac-4898-25a2-641ecef86545.htm
---
# StructuralSectionCProfileWithFold Members

Creates a new instance of Structural Section C Profile With Fold shape with the associated set of parameters,
 used to attach to structural element.